SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/BGM21/Include/bgm21_protimer.h
#define PROTIMER_IEN_LBTRETRY                            (0x1UL << 27)                               /**< LBTRETRY Interrupt Enable                   */
#define _PROTIMER_IEN_LBTRETRY_SHIFT                     27                                          /**< Shift value for PROTIMER_LBTRETRY           */
#define _PROTIMER_IEN_LBTRETRY_MASK                      0x8000000UL                                 /**< Bit mask for PROTIMER_LBTRETRY              */
#define _PROTIMER_IEN_LBTRETRY_DEFAULT                   0x00000000UL                                /**< Mode DEFAULT for PROTIMER_IEN               */
#define PROTIMER_IEN_LBTRETRY_DEFAULT                    (_PROTIMER_IEN_LBTRETRY_DEFAULT << 27)      /**< Shifted mode DEFAULT for PROTIMER_IEN       */
#define PROTIMER_IEN_RTCCSYNCHED                         (0x1UL << 28)                               /**< RTCCSYNCHED Interrupt Enable                */
#define _PROTIMER_IEN_RTCCSYNCHED_SHIFT                  28                                          /**< Shift value for PROTIMER_RTCCSYNCHED        */
#define _PROTIMER_IEN_RTCCSYNCHED_MASK                   0x10000000UL                                /**< Bit mask for PROTIMER_RTCCSYNCHED           */
#define _PROTIMER_IEN_RTCCSYNCHED_DEFAULT                0x00000000UL                                /**< Mode DEFAULT for PROTIMER_IEN               */
#define PROTIMER_IEN_RTCCSYNCHED_DEFAULT                 (_PROTIMER_IEN_RTCCSYNCHED_DEFAULT << 28)   /**< Shifted mode DEFAULT for PROTIMER_IEN       */
#define PROTIMER_IEN_TOUT0MATCHLBT                       (0x1UL << 29)                               /**< TOUT0MATCHLBT Interrupt Enable              */
#define _PROTIMER_IEN_TOUT0MATCHLBT_SHIFT                29                                          /**< Shift value for PROTIMER_TOUT0MATCHLBT      */
#define _PROTIMER_IEN_TOUT0MATCHLBT_MASK                 0x20000000UL                                /**< Bit mask for PROTIMER_TOUT0MATCHLBT         */
#define _PROTIMER_IEN_TOUT0MATCHLBT_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for PROTIMER_IEN               */
#define PROTIMER_IEN_TOUT0MATCHLBT_DEFAULT               (_PROTIMER_IEN_TOUT0MATCHLBT_DEFAULT << 29) /**< Shifted mode DEFAULT for PROTIMER_IEN       */

/* Bit fields for PROTIMER RXCTRL */
#define _PROTIMER_RXCTRL_RESETVALUE                      0x00000000UL                                      /**< Default value for PROTIMER_RXCTRL           */
#define _PROTIMER_RXCTRL_MASK                            0x1F1F1F1FUL                                      /**< Mask for PROTIMER_RXCTRL                    */
#define _PROTIMER_RXCTRL_RXSETEVENT1_SHIFT               0                                                 /**< Shift value for PROTIMER_RXSETEVENT1        */
#define _PROTIMER_RXCTRL_RXSETEVENT1_MASK                0x1FUL                                            /**< Bit mask for PROTIMER_RXSETEVENT1           */
#define _PROTIMER_RXCTRL_RXSETEVENT1_DEFAULT             0x00000000UL                                      /**< Mode DEFAULT for PROTIMER_RXCTRL            */
#define _PROTIMER_RXCTRL_RXSETEVENT1_DISABLED            0x00000000UL                                      /**< Mode DISABLED for PROTIMER_RXCTRL           */
#define _PROTIMER_RXCTRL_RXSETEVENT1_ALWAYS              0x00000001UL                                      /**< Mode ALWAYS for PROTIMER_RXCTRL             */
#define _PROTIMER_RXCTRL_RXSETEVENT1_PRECNTOF            0x00000002UL                                      /**< Mode PRECNTOF for PROTIMER_RXCTRL           */
#define _PROTIMER_RXCTRL_RXSETEVENT1_BASECNTOF           0x00000003UL                                      /**< Mode BASECNTOF for PROTIMER_RXCTRL          */
#define _PROTIMER_RXCTRL_RXSETEVENT1_WRAPCNTOF           0x00000004UL                                      /**< Mode WRAPCNTOF for PROTIMER_RXCTRL          */
#define _PROTIMER_RXCTRL_RXSETEVENT1_TOUT0UF             0x00000005UL                                      /**< Mode TOUT0UF for PROTIMER_RXCTRL            */
#define _PROTIMER_RXCTRL_RXSETEVENT1_TOUT1UF             0x00000006UL                                      /**< Mode TOUT1UF for PROTIMER_RXCTRL            */
#define _PROTIMER_RXCTRL_RXSETEVENT1_TOUT0MATCH          0x00000007UL                                      /**< Mode TOUT0MATCH for PROTIMER_RXCTRL         */
#define _PROTIMER_RXCTRL_RXSETEVENT1_TOUT1MATCH          0x00000008UL                                      /**< Mode TOUT1MATCH for PROTIMER_RXCTRL         */
#define _PROTIMER_RXCTRL_RXSETEVENT1_CC0                 0x00000009UL                                      /**< Mode CC0 for PROTIMER_RXCTRL                */
#define _PROTIMER_RXCTRL_RXSETEVENT1_CC1                 0x0000000AUL                                      /**< Mode CC1 for PROTIMER_RXCTRL                */
#define _PROTIMER_RXCTRL_RXSETEVENT1_CC2                 0x0000000BUL                                      /**< Mode CC2 for PROTIMER_RXCTRL                */
#define _PROTIMER_RXCTRL_RXSETEVENT1_CC3                 0x0000000CUL                                      /**< Mode CC3 for PROTIMER_RXCTRL                */
#define _PROTIMER_RXCTRL_RXSETEVENT1_CC4                 0x0000000DUL                                      /**< Mode CC4 for PROTIMER_RXCTRL                */
#define _PROTIMER_RXCTRL_RXSETEVENT1_TXDONE              0x0000000EUL                                      /**< Mode TXDONE for PROTIMER_RXCTRL             */
#define _PROTIMER_RXCTRL_RXSETEVENT1_RXDONE              0x0000000FUL                                      /**< Mode RXDONE for PROTIMER_RXCTRL             */
#define _PROTIMER_RXCTRL_RXSETEVENT1_TXORRXDONE          0x00000010UL                                      /**< Mode TXORRXDONE for PROTIMER_RXCTRL         */
#define _PROTIMER_RXCTRL_RXSETEVENT1_FDET0               0x00000011UL                                      /**< Mode FDET0 for PROTIMER_RXCTRL              */
#define _PROTIMER_RXCTRL_RXSETEVENT1_FDET1               0x00000012UL                                      /**< Mode FDET1 for PROTIMER_RXCTRL              */
#define _PROTIMER_RXCTRL_RXSETEVENT1_FDET0OR1            0x00000013UL                                      /**< Mode FDET0OR1 for PROTIMER_RXCTRL           */
#define _PROTIMER_RXCTRL_RXSETEVENT1_LBTSUCCESS          0x00000014UL                                      /**< Mode LBTSUCCESS for PROTIMER_RXCTRL         */
#define _PROTIMER_RXCTRL_RXSETEVENT1_LBTRETRY            0x00000015UL                                      /**< Mode LBTRETRY for PROTIMER_RXCTRL           */
#define _PROTIMER_RXCTRL_RXSETEVENT1_LBTFAILURE          0x00000016UL                                      /**< Mode LBTFAILURE for PROTIMER_RXCTRL         */
#define _PROTIMER_RXCTRL_RXSETEVENT1_ANYLBT              0x00000017UL                                      /**< Mode ANYLBT for PROTIMER_RXCTRL             */
#define _PROTIMER_RXCTRL_RXSETEVENT1_CCAACK              0x00000018UL                                      /**< Mode CCAACK for PROTIMER_RXCTRL             */
#define _PROTIMER_RXCTRL_RXSETEVENT1_CCA                 0x00000019UL                                      /**< Mode CCA for PROTIMER_RXCTRL                */
#define _PROTIMER_RXCTRL_RXSETEVENT1_NOTCCA              0x0000001AUL                                      /**< Mode NOTCCA for PROTIMER_RXCTRL             */
#define _PROTIMER_RXCTRL_RXSETEVENT1_TOUT0MATCHLBT       0x0000001BUL                                      /**< Mode TOUT0MATCHLBT for PROTIMER_RXCTRL      */
#define PROTIMER_RXCTRL_RXSETEVENT1_DEFAULT              (_PROTIMER_RXCTRL_RXSETEVENT1_DEFAULT << 0)       /**< Shifted mode DEFAULT for PROTIMER_RXCTRL    */
#define PROTIMER_RXCTRL_RXSETEVENT1_DISABLED             (_PROTIMER_RXCTRL_RXSETEVENT1_DISABLED << 0)      /**< Shifted mode DISABLED for PROTIMER_RXCTRL   */
#define PROTIMER_RXCTRL_RXSETEVENT1_ALWAYS               (_PROTIMER_RXCTRL_RXSETEVENT1_ALWAYS << 0)        /**< Shifted mode ALWAYS for PROTIMER_RXCTRL     */
#define PROTIMER_RXCTRL_RXSETEVENT1_PRECNTOF             (_PROTIMER_RXCTRL_RXSETEVENT1_PRECNTOF << 0)      /**< Shifted mode PRECNTOF for PROTIMER_RXCTRL   */
#define PROTIMER_RXCTRL_RXSETEVENT1_BASECNTOF            (_PROTIMER_RXCTRL_RXSETEVENT1_BASECNTOF << 0)     /**< Shifted mode BASECNTOF for PROTIMER_RXCTRL  */
#define PROTIMER_RXCTRL_RXSETEVENT1_WRAPCNTOF            (_PROTIMER_RXCTRL_RXSETEVENT1_WRAPCNTOF << 0)     /**< Shifted mode WRAPCNTOF for PROTIMER_RXCTRL  */
#define PROTIMER_RXCTRL_RXSETEVENT1_TOUT0UF              (_PROTIMER_RXCTRL_RXSETEVENT1_TOUT0UF << 0)       /**< Shifted mode TOUT0UF for PROTIMER_RXCTRL    */
#define PROTIMER_RXCTRL_RXSETEVENT1_TOUT1UF              (_PROTIMER_RXCTRL_RXSETEVENT1_TOUT1UF << 0)       /**< Shifted mode TOUT1UF for PROTIMER_RXCTRL    */
#define PROTIMER_RXCTRL_RXSETEVENT1_TOUT0MATCH           (_PROTIMER_RXCTRL_RXSETEVENT1_TOUT0MATCH << 0)    /**< Shifted mode TOUT0MATCH for PROTIMER_RXCTRL */
#define PROTIMER_RXCTRL_RXSETEVENT1_TOUT1MATCH           (_PROTIMER_RXCTRL_RXSETEVENT1_TOUT1MATCH << 0)    /**< Shifted mode TOUT1MATCH for PROTIMER_RXCTRL */
#define PROTIMER_RXCTRL_RXSETEVENT1_CC0                  (_PROTIMER_RXCTRL_RXSETEVENT1_CC0 << 0)           /**< Shifted mode CC0 for PROTIMER_RXCTRL        */
#define PROTIMER_RXCTRL_RXSETEVENT1_CC1                  (_PROTIMER_RXCTRL_RXSETEVENT1_CC1 << 0)           /**< Shifted mode CC1 for PROTIMER_RXCTRL        */
#define PROTIMER_RXCTRL_RXSETEVENT1_CC2                  (_PROTIMER_RXCTRL_RXSETEVENT1_CC2 << 0)           /**< Shifted mode CC2 for PROTIMER_RXCTRL        */
#define PROTIMER_RXCTRL_RXSETEVENT1_CC3                  (_PROTIMER_RXCTRL_RXSETEVENT1_CC3 << 0)           /**< Shifted mode CC3 for PROTIMER_RXCTRL        */
#define PROTIMER_RXCTRL_RXSETEVENT1_CC4                  (_PROTIMER_RXCTRL_RXSETEVENT1_CC4 << 0)           /**< Shifted mode CC4 for PROTIMER_RXCTRL        */
#define PROTIMER_RXCTRL_RXSETEVENT1_TXDONE               (_PROTIMER_RXCTRL_RXSETEVENT1_TXDONE << 0)        /**< Shifted mode TXDONE for PROTIMER_RXCTRL     */
#define PROTIMER_RXCTRL_RXSETEVENT1_RXDONE               (_PROTIMER_RXCTRL_RXSETEVENT1_RXDONE << 0)        /**< Shifted mode RXDONE for PROTIMER_RXCTRL     */
#define PROTIMER_RXCTRL_RXSETEVENT1_TXORRXDONE           (_PROTIMER_RXCTRL_RXSETEVENT1_TXORRXDONE << 0)    /**< Shifted mode TXORRXDONE for PROTIMER_RXCTRL */
#define PROTIMER_RXCTRL_RXSETEVENT1_FDET0                (_PROTIMER_RXCTRL_RXSETEVENT1_FDET0 << 0)         /**< Shifted mode FDET0 for PROTIMER_RXCTRL      */
#define PROTIMER_RXCTRL_RXSETEVENT1_FDET1                (_PROTIMER_RXCTRL_RXSETEVENT1_FDET1 << 0)         /**< Shifted mode FDET1 for PROTIMER_RXCTRL      */
#define PROTIMER_RXCTRL_RXSETEVENT1_FDET0OR1             (_PROTIMER_RXCTRL_RXSETEVENT1_FDET0OR1 << 0)      /**< Shifted mode FDET0OR1 for PROTIMER_RXCTRL   */
#define PROTIMER_RXCTRL_RXSETEVENT1_LBTSUCCESS           (_PROTIMER_RXCTRL_RXSETEVENT1_LBTSUCCESS << 0)    /**< Shifted mode LBTSUCCESS for PROTIMER_RXCTRL */
#define PROTIMER_RXCTRL_RXSETEVENT1_LBTRETRY             (_PROTIMER_RXCTRL_RXSETEVENT1_LBTRETRY << 0)      /**< Shifted mode LBTRETRY for PROTIMER_RXCTRL   */
#define PROTIMER_RXCTRL_RXSETEVENT1_LBTFAILURE           (_PROTIMER_RXCTRL_RXSETEVENT1_LBTFAILURE << 0)    /**< Shifted mode LBTFAILURE for PROTIMER_RXCTRL */
#define PROTIMER_RXCTRL_RXSETEVENT1_ANYLBT               (_PROTIMER_RXCTRL_RXSETEVENT1_ANYLBT << 0)        /**< Shifted mode ANYLBT for PROTIMER_RXCTRL     */
#define PROTIMER_RXCTRL_RXSETEVENT1_CCAACK               (_PROTIMER_RXCTRL_RXSETEVENT1_CCAACK << 0)        /**< Shifted mode CCAACK for PROTIMER_RXCTRL     */
#define PROTIMER_RXCTRL_RXSETEVENT1_CCA                  (_PROTIMER_RXCTRL_RXSETEVENT1_CCA << 0)           /**< Shifted mode CCA for PROTIMER_RXCTRL        */
#define PROTIMER_RXCTRL_RXSETEVENT1_NOTCCA               (_PROTIMER_RXCTRL_RXSETEVENT1_NOTCCA << 0)        /**< Shifted mode NOTCCA for PROTIMER_RXCTRL     */
#define PROTIMER_RXCTRL_RXSETEVENT1_TOUT0MATCHLBT        (_PROTIMER_RXCTRL_RXSETEVENT1_TOUT0MATCHLBT << 0) /**< Shifted mode TOUT0MATCHLBT for PROTIMER_RXCTRL*/
#define _PROTIMER_RXCTRL_RXSETEVENT2_SHIFT               8                                                 /**< Shift value for PROTIMER_RXSETEVENT2        */
#define _PROTIMER_RXCTRL_RXSETEVENT2_MASK                0x1F00UL                                          /**< Bit mask for PROTIMER_RXSETEVENT2           */
#define _PROTIMER_RXCTRL_RXSETEVENT2_DEFAULT             0x00000000UL                                      /**< Mode DEFAULT for PROTIMER_RXCTRL            */
#define PROTIMER_RXCTRL_RXSETEVENT2_DEFAULT              (_PROTIMER_RXCTRL_RXSETEVENT2_DEFAULT << 8)       /**< Shifted mode DEFAULT for PROTIMER_RXCTRL    */
#define _PROTIMER_RXCTRL_RXCLREVENT1_SHIFT               16                                                /**< Shift value for PROTIMER_RXCLREVENT1        */
#define _PROTIMER_RXCTRL_RXCLREVENT1_MASK                0x1F0000UL                                        /**< Bit mask for PROTIMER_RXCLREVENT1           */
#define _PROTIMER_RXCTRL_RXCLREVENT1_DEFAULT             0x00000000UL                                      /**< Mode DEFAULT for PROTIMER_RXCTRL            */
#define PROTIMER_RXCTRL_RXCLREVENT1_DEFAULT              (_PROTIMER_RXCTRL_RXCLREVENT1_DEFAULT << 16)      /**< Shifted mode DEFAULT for PROTIMER_RXCTRL    */
#define _PROTIMER_RXCTRL_RXCLREVENT2_SHIFT               24                                                /**< Shift value for PROTIMER_RXCLREVENT2        */
#define _PROTIMER_RXCTRL_RXCLREVENT2_MASK                0x1F000000UL                                      /**< Bit mask for PROTIMER_RXCLREVENT2           */
#define _PROTIMER_RXCTRL_RXCLREVENT2_DEFAULT             0x00000000UL                                      /**< Mode DEFAULT for PROTIMER_RXCTRL            */
#define PROTIMER_RXCTRL_RXCLREVENT2_DEFAULT              (_PROTIMER_RXCTRL_RXCLREVENT2_DEFAULT << 24)      /**< Shifted mode DEFAULT for PROTIMER_RXCTRL    */

